package ua.hillel.shutko.lessons.lesson15.carType;

public enum DemoEnum {
    OBJ_1, // при дефолтному конструкторі не потрібно ставити дужки ()
    OBJ_2,
    OBJ_3 // не обов'язково ставити ; лише якщо після об'єктів є змінні, дефолтний конструктор, що не будь тоді
    // потрібно ставити ;

    // *** можна записати в один рядок  OBJ_1, OBJ_2, OBJ_3

    // *** нельзя додавати змінні перед об'єктами

    // *** об'єкти в Enum є константними (public static final) тому потрібно називати їх у верхньому регістрі так як і
    // змінні які є константими (public static final), якщо назва складаються з декількох слів тоді вони розділяються
    // нижнім підкресленням _
}
